mkulesh/stm32DevelopmentBoards/src/StmPlusPlus/StmPlusPlus.cpp
    usartParameters.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    usartParameters.Init.OverSampling = UART_OVERSAMPLING_16;
    #ifdef UART_ONE_BIT_SAMPLE_DISABLE
    usartParameters.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    #endif
    #ifdef UART_ADVFEATURE_NO_INIT
    usartParameters.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    #endif
    irqStatus = RESET;
}

void Usart::enableClock()
{
    switch (device)
    {
    case USART_1: __HAL_RCC_USART1_CLK_ENABLE(); break;
    case USART_2: __HAL_RCC_USART2_CLK_ENABLE(); break;
    case USART_6:
        #ifdef USART6
        __HAL_RCC_USART6_CLK_ENABLE();
        #endif
    break;
    }
}

void Usart::disableClock()
{
    switch (device)
    {
    case USART_1: __HAL_RCC_USART1_CLK_DISABLE(); break;
    case USART_2: __HAL_RCC_USART2_CLK_DISABLE(); break;
    case USART_6:
        #ifdef USART6
        __HAL_RCC_USART6_FORCE_RESET();
        __HAL_RCC_USART6_RELEASE_RESET();
        __HAL_RCC_USART6_CLK_DISABLE();
        #endif
        break;
    }
}

HAL_StatusTypeDef Usart::start (uint32_t mode,
                   uint32_t baudRate,
                   uint32_t wordLength/* = UART_WORDLENGTH_8B*/,
                   uint32_t stopBits/* = UART_STOPBITS_1*/,
                   uint32_t parity/* = UART_PARITY_NONE*/)
{
    enableClock();
    usartParameters.Init.Mode = mode;
    usartParameters.Init.BaudRate = baudRate;
    usartParameters.Init.WordLength = wordLength;
    usartParameters.Init.StopBits = stopBits;
    usartParameters.Init.Parity = parity;
    return HAL_UART_Init(&usartParameters);
}

HAL_StatusTypeDef Usart::stop ()
{
    HAL_StatusTypeDef retValue = HAL_UART_DeInit(&usartParameters);
    disableClock();
    return retValue;
}

HAL_StatusTypeDef Usart::transmit (const char * buffer, size_t n, uint32_t timeout)
{
    return HAL_UART_Transmit(&usartParameters, (unsigned char *)buffer, n, timeout);
}

HAL_StatusTypeDef Usart::transmit (const char * buffer)
{
    return HAL_UART_Transmit(&usartParameters, (unsigned char *)buffer, ::strlen(buffer), 0xFFFF);
}

HAL_StatusTypeDef Usart::receive (const char * buffer, size_t n, uint32_t timeout)
{
    return HAL_UART_Receive(&usartParameters, (unsigned char *)buffer, n, timeout);
}

HAL_StatusTypeDef Usart::transmitIt (const char * buffer, size_t n)
{
    irqStatus = RESET;
    return HAL_UART_Transmit_IT(&usartParameters, (unsigned char *)buffer, n);
}

HAL_StatusTypeDef Usart::receiveIt (const char * buffer, size_t n)
{
    irqStatus = RESET;
    return HAL_UART_Receive_IT(&usartParameters, (unsigned char *)buffer, n);
}

/************************************************************************
 * Class UsartLogger
 ************************************************************************/

UsartLogger * UsartLogger::instance = NULL;


UsartLogger::UsartLogger (DeviceName device, PortName name, uint32_t txPin, uint32_t rxPin, uint32_t _baudRate):
    Usart(device, name, txPin, rxPin),
    baudRate(_baudRate)
{
    // empty
}

UsartLogger & UsartLogger::operator << (const char * buffer)
{
    transmit(buffer);
    return *this;
}

UsartLogger & UsartLogger::operator << (int n)
{
    char buffer[1024];
    ::__itoa(n, buffer, 10);
    transmit(buffer);
    return *this;
}

UsartLogger & UsartLogger::operator << (Manupulator /*m*/)
{
    transmit("\n\r");
    return *this;
}

/************************************************************************
 * Class TimerBase
 ************************************************************************/
#define INITIALIZE_STMPLUSPLUS_TIMER(name, enableName) { \
        enableName(); \
        timerParameters.Instance = name; \
        }


TimerBase::TimerBase (TimerName timerName)
{
    switch (timerName)
    {
    case TIM_1:
        #ifdef TIM1
        INITIALIZE_STMPLUSPLUS_TIMER(TIM1, __TIM1_CLK_ENABLE);
        #endif
        break;
    case TIM_2:
        #ifdef TIM2
        INITIALIZE_STMPLUSPLUS_TIMER(TIM2, __TIM2_CLK_ENABLE);
        #endif
        break;
    case TIM_3:
        #ifdef TIM3
        INITIALIZE_STMPLUSPLUS_TIMER(TIM3, __TIM3_CLK_ENABLE);
        #endif
        break;
    case TIM_4:
        #ifdef TIM4
        INITIALIZE_STMPLUSPLUS_TIMER(TIM4, __TIM4_CLK_ENABLE);
        #endif
        break;
    case TIM_5:
        #ifdef TIM5
        INITIALIZE_STMPLUSPLUS_TIMER(TIM5, __TIM5_CLK_ENABLE);
        #endif
        break;
    case TIM_6:
        #ifdef TIM6
        INITIALIZE_STMPLUSPLUS_TIMER(TIM6, __TIM6_CLK_ENABLE);
        #endif
        break;
    case TIM_7:
        #ifdef TIM7
        INITIALIZE_STMPLUSPLUS_TIMER(TIM7, __TIM7_CLK_ENABLE);
        #endif
        break;
    case TIM_8:
        #ifdef TIM8
        INITIALIZE_STMPLUSPLUS_TIMER(TIM8, __TIM8_CLK_ENABLE);
        #endif
        break;
    case TIM_9:
        #ifdef TIM9
        INITIALIZE_STMPLUSPLUS_TIMER(TIM9, __TIM9_CLK_ENABLE);
        #endif
        break;
    case TIM_10:
        #ifdef TIM10
        INITIALIZE_STMPLUSPLUS_TIMER(TIM10, __TIM10_CLK_ENABLE);
        #endif
        break;
    case TIM_11:
        #ifdef TIM11
        INITIALIZE_STMPLUSPLUS_TIMER(TIM11, __TIM11_CLK_ENABLE);
        #endif
        break;
    case TIM_12:
        #ifdef TIM12
        INITIALIZE_STMPLUSPLUS_TIMER(TIM12, __TIM12_CLK_ENABLE);
        #endif
        break;
    case TIM_13:
        #ifdef TIM13
        INITIALIZE_STMPLUSPLUS_TIMER(TIM13, __TIM13_CLK_ENABLE);
        #endif
        break;
    case TIM_14:
        #ifdef TIM10
        INITIALIZE_STMPLUSPLUS_TIMER(TIM14, __TIM14_CLK_ENABLE);
        #endif
        break;
    case TIM_15:
        #ifdef TIM15
        INITIALIZE_STMPLUSPLUS_TIMER(TIM15, __TIM15_CLK_ENABLE);
        #endif
        break;
    case TIM_16:
        #ifdef TIM16
        INITIALIZE_STMPLUSPLUS_TIMER(TIM16, __TIM16_CLK_ENABLE);
        #endif
        break;
    case TIM_17:
        #ifdef TIM17
        INITIALIZE_STMPLUSPLUS_TIMER(TIM17, __TIM17_CLK_ENABLE);
        #endif
        break;
    }
}

HAL_StatusTypeDef TimerBase::startCounter (uint32_t counterMode,
                         uint32_t prescaler,
                         uint32_t period,
                         uint32_t clockDivision/* = TIM_CLOCKDIVISION_DIV1*/)
{
    timerParameters.Init.CounterMode = counterMode;
    timerParameters.Init.Prescaler = prescaler;
    timerParameters.Init.Period = period;
    timerParameters.Init.ClockDivision = clockDivision;
    __HAL_TIM_SET_COUNTER(&timerParameters, 0);

    HAL_TIM_Base_Init(&timerParameters);
    return HAL_TIM_Base_Start(&timerParameters);
}

HAL_StatusTypeDef TimerBase::stopCounter ()
{
    HAL_TIM_Base_Stop(&timerParameters);
    return HAL_TIM_Base_DeInit(&timerParameters);
}

/************************************************************************
 * Class TimerBase
 ************************************************************************/
PulseWidthModulation::PulseWidthModulation (IOPort::PortName name, uint32_t _pin, TimerName timerName, uint32_t _channel):
    TimerBase(timerName),
    pin(name, _pin, GPIO_MODE_AF_PP, GPIO_PULLDOWN, GPIO_SPEED_FREQ_HIGH, false, false),
    channel(_channel)
{
    switch (timerName)
    {
    case TIM_2:
        #ifdef GPIO_AF2_TIM2
        pin.setAlternate(GPIO_AF2_TIM2);
        #endif
        break;
    default:
        break;
    }

    timerParameters.Init.Prescaler     = 0;
    timerParameters.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    timerParameters.Init.CounterMode   = TIM_COUNTERMODE_UP;
    channelParameters.OCMode           = TIM_OCMODE_PWM1;
    channelParameters.OCPolarity       = TIM_OCPOLARITY_HIGH;
    channelParameters.OCFastMode       = TIM_OCFAST_DISABLE;
}


bool PulseWidthModulation::start (uint32_t freq)
{
    uint32_t uwPeriodValue = SystemCoreClock/freq;
    timerParameters.Init.Period = uwPeriodValue - 1;
    channelParameters.Pulse = uwPeriodValue/2;

    HAL_StatusTypeDef status = HAL_TIM_PWM_Init(&timerParameters);
    if(status != HAL_OK)
    {
        USART_DEBUG("Cannot initialize PWM timer: " << status);
        return false;
    }

    status = HAL_TIM_PWM_ConfigChannel(&timerParameters, &channelParameters, channel);
    if(status != HAL_OK)
    {
        USART_DEBUG("Cannot initialize PWM channel: " << status);
        return false;
    }

