mkulesh/stm32DevelopmentBoards/src/StmPlusPlus/StmPlusPlus.cpp
void AnalogToDigitConverter::disableClock()
{
    switch (device)
    {
    case ADC_1:
        #ifdef ADC1
        __ADC1_CLK_DISABLE();
        #endif
        break;
    case ADC_2:
        #ifdef ADC2
        __ADC2_CLK_DISABLE();
        #endif
        break;
    case ADC_3:
        #ifdef __HAL_RCC_ADC3_CLK_DISABLE
        __ADC3_CLK_DISABLE();
        #endif
        break;
    }
}


HAL_StatusTypeDef AnalogToDigitConverter::start ()
{
    hadc = &adcParams;
    enableClock();

    HAL_StatusTypeDef status = HAL_ADC_Init(hadc);
    if (status != HAL_OK)
    {
        USART_DEBUG("Can not initialize ACD " << (size_t)device << ": " << status);
        return status;
    }

    status = HAL_ADC_ConfigChannel(hadc, &adcChannel);
    if (status != HAL_OK)
    {
        USART_DEBUG("Can not configure ACD channel " << adcChannel.Channel << ": " << status);
        return status;
    }

    USART_DEBUG("Started ACD " << (size_t)device
             << ": channel = " << adcChannel.Channel
             << ", Status = " << status);

    return status;
}


HAL_StatusTypeDef AnalogToDigitConverter::stop ()
{
    USART_DEBUG("Stopping ADC " << (size_t)device);
    HAL_StatusTypeDef retValue = HAL_ADC_DeInit(&adcParams);
    disableClock();
    hadc = NULL;
    return retValue;
}


uint32_t AnalogToDigitConverter::getValue ()
{
    uint32_t value = INVALID_VALUE;
    if (hadc == NULL)
    {
        return value;
    }
    if (HAL_ADC_Start(hadc) == HAL_OK)
    {
        if (HAL_ADC_PollForConversion(hadc, 10000) == HAL_OK)
        {
            value = HAL_ADC_GetValue(hadc);
        }
    }
    HAL_ADC_Stop(hadc);
    return value;
}


float AnalogToDigitConverter::getVoltage ()
{
    return (vRef * (float)getValue())/4095.0;
}

/************************************************************************
 * Class I2S
 ************************************************************************/
I2S::I2S (PortName name, uint32_t pin, const InterruptPriority & prio):
    IOPort{name, GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, pin, false},
    irqPrio{prio}
{
    i2s.Instance = SPI2;
    i2s.Init.Mode = I2S_MODE_MASTER_TX;
    i2s.Init.Standard = I2S_STANDARD_PHILIPS; // will be re-defined at communication start
    i2s.Init.DataFormat = I2S_DATAFORMAT_16B; // will be re-defined at communication start
    i2s.Init.MCLKOutput = I2S_MCLKOUTPUT_DISABLE;
    i2s.Init.AudioFreq = I2S_AUDIOFREQ_44K; // will be re-defined at communication start
    i2s.Init.CPOL = I2S_CPOL_LOW;
    i2s.Init.ClockSource = I2S_CLOCK_PLL;
    i2s.Init.FullDuplexMode = I2S_FULLDUPLEXMODE_DISABLE;

    i2sDmaTx.Instance = DMA1_Stream4;
    i2sDmaTx.Init.Channel = DMA_CHANNEL_0;
    i2sDmaTx.Init.Direction = DMA_MEMORY_TO_PERIPH;
    i2sDmaTx.Init.PeriphInc = DMA_PINC_DISABLE;
    i2sDmaTx.Init.MemInc = DMA_MINC_ENABLE;
    i2sDmaTx.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    i2sDmaTx.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    i2sDmaTx.Init.Mode = DMA_NORMAL;
    i2sDmaTx.Init.Priority = DMA_PRIORITY_LOW;
    i2sDmaTx.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
    i2sDmaTx.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
    i2sDmaTx.Init.MemBurst = DMA_PBURST_SINGLE;
    i2sDmaTx.Init.PeriphBurst = DMA_PBURST_SINGLE;
}


HAL_StatusTypeDef I2S::start (uint32_t standard, uint32_t audioFreq, uint32_t dataFormat)
{
    i2s.Init.Standard = standard;
    i2s.Init.AudioFreq = audioFreq;
    i2s.Init.DataFormat = dataFormat;
    setMode(GPIO_MODE_AF_PP);
    setAlternate(GPIO_AF5_SPI2);

    __HAL_RCC_SPI2_CLK_ENABLE();
    HAL_StatusTypeDef status = HAL_I2S_Init(&i2s);
    if (status != HAL_OK)
    {
        USART_DEBUG("Can not start I2S: " << status);
        return HAL_ERROR;
    }

    __HAL_RCC_DMA1_CLK_ENABLE();
    __HAL_LINKDMA(&i2s, hdmatx, i2sDmaTx);
    status = HAL_DMA_Init(&i2sDmaTx);
    if (status != HAL_OK)
    {
        USART_DEBUG("Can not initialize I2S DMA/TX channel: " << status);
        return HAL_ERROR;
    }

    HAL_NVIC_SetPriority(I2S_IRQ, irqPrio.first, irqPrio.second);
    HAL_NVIC_EnableIRQ(I2S_IRQ);
    HAL_NVIC_SetPriority(DMA_TX_IRQ, irqPrio.first + 1, irqPrio.second);
    HAL_NVIC_EnableIRQ(DMA_TX_IRQ);

    return HAL_OK;
}


void I2S::stop ()
{
    HAL_NVIC_DisableIRQ(I2S_IRQ);
    HAL_NVIC_DisableIRQ(DMA_TX_IRQ);
    HAL_DMA_DeInit(&i2sDmaTx);
    __HAL_RCC_DMA1_CLK_DISABLE();
    HAL_I2S_DeInit(&i2s);
    __HAL_RCC_SPI2_CLK_DISABLE();
    setMode(GPIO_MODE_INPUT);
}


